class TxtInterface:
    greeting = "Выберите нужный пункт меню: "
    enter_title = "Введите заголовок"
    enter_note = "Введите текст заметки"
    is_empty = "Пусто"
    first_menu = "\
            1 - Создать новую заметку;\n\
            2 - Просмотр всех заметок;\n\
            3 - Просмотр последней заметки;\n\
            4 - Редактирование;\n\
            5 - Удаление;\n\
            6 - Экспорт заметки в json формате;\n\
            7 - Импорт json заметки;\n\
            0 - Выход."
    enter_command = "Введите команду: "
    not_save = "Не сохранено"
    goodbye = "Досвидания!"
    incorrect_input = "Некорректный ввод"
    notes_imported = "Импортировано"
    notes_empty = "Заметки пустые"
    notes_saved = "Заметки сохранены "
    show_notes = "Все заметки:"
    show_last = "Последняя заметка"
    edit_note = "Введите заголовок заметки для редактирования: "
    current_title = "Текущий заголовок: "
    current_note = "Текущяя заметка: "
    enter_ID = "Введите ID заметки для ее удаления: "
    note_deleted = "Заметка удалена"
    not_file = "Файл не найден"
